// 配合timeEnd()成對出現。 打印出代碼執行的時間
console.time('共耗費了')
// 導入模組
var fs = require('fs')
var path = require('path')
// 可改寫副檔名及編碼
var x = '.txt'
var ru = 'utf16le'
var wu = 'utf8'
// 子目錄名，如果有的話
var mula = 'ThonZu/'
// 完成後的副檔名
var afterName = '.xml'
// 裝載運算結果的物件
var okfile = ''
// 取得目錄列表
// var h = path.normalize('./xml')

// var lst = fs.readFileSync(mula + 'paauk.lst', wu).split('\n')
// fs.writeFileSync('p.lst', lst.join('\n'), wu)
// lst = fs.readFileSync('p.lst', wu).split('\n')
var lst = ["律 藏 會 集1.txt", "戒本/四分律比丘戒本.txt", "戒本/四分律比丘尼戒本.txt", "戒本/梵網經菩薩戒本.txt", "戒本/瑜珈菩薩戒本.txt", "五  部  律/四  分  律.txt", "五  部  律/五  分  律1.txt", "五  部  律/十  誦  律.txt", "五  部  律/一切有部.txt", "五  部  律/僧  祇  律.txt", "三  大  部/s.txt", "三  大  部/x.txt", "三  大  部/j.txt", "南山三大部輯要表解1.txt", "天因律師全集.txt", "五戒八戒學處/序文.txt", "五戒八戒學處/凡例0620.txt", "五戒八戒學處/0620五八戒學處 目次.txt", "五戒八戒學處/0620五戒 學處修訂版.txt", "五戒八戒學處/0620八戒學處修訂版.txt", "五戒八戒學處/0620附錄.txt", "五戒八戒學處/勘誤表.txt", "果清律師全集.txt", "沙彌律儀/沙 彌 律 儀.txt", "沙彌律儀/沙彌十戒威儀錄要及補充講表－-940425-A5版.txt", "沙彌律儀/沙彌十戒威儀錄要補充講表.txt", "沙彌學處.txt", "比丘戒/比 丘 戒 講 義.txt", "巴利比丘戒.txt", "教誡新學比丘行護律儀集解.txt", "隨戒釋相篇講義/隨相講義 封面.txt", "隨戒釋相篇講義/隨相講義 目錄.txt", "隨戒釋相篇講義/隨戒釋相篇上版.txt", "隨戒釋相篇講義/隨戒釋相篇下版.txt", "隨戒釋相篇講義/袈裟製作圖.txt", "隨戒釋相篇講義/隨戒釋相篇回向偈doc.txt", "戒法戒體要義/WORD/目錄.txt", "戒法戒體要義/WORD/卷十五篇首.txt", "戒法戒體要義/WORD/卷十五科文.txt", "戒法戒體要義/WORD/卷十五.txt", "戒法戒體要義/WORD/卷十五補充講義.txt", "戒法戒體要義/WORD/卷十六篇首.txt", "戒法戒體要義/WORD/卷十六科文.txt", "戒法戒體要義/WORD/卷十六.txt", "戒法戒體要義/WORD/卷十六補充講義.txt", "戒法戒體要義/WORD/附錄-940520.txt", "戒法戒體要義/WORD/內頁封面-1.txt", "戒法戒體要義/WORD/內頁封面.txt", "拾毗尼義鈔.txt", "袈裟的內涵.txt", "盜戒精要.txt", "盜戒資料/盜科判.txt", "盜戒資料/盜戒.txt", "盜戒資料/南傳律藏_戒律綱要.txt", "盜戒資料/盜戒精要/戒疏記(盜戒精要)通用-930105.txt", "盜戒資料/盜戒精要/回向偈.txt", "盜戒資料/盜戒編輯資料/鈔記-921221.txt", "盜戒資料/盜戒編輯資料/鈔記科文-921222.txt", "盜戒資料/盜戒編輯資料/戒疏記-921223.txt", "盜戒資料/盜戒編輯資料/戒疏記原文-921223.txt", "盜戒資料/盜戒編輯資料/戒疏記科文-921226.txt", "盜戒資料/盜戒編輯資料/在家備覽-930122.txt", "四藥受淨篇/四藥受淨篇.txt", "四藥受淨篇/過前受急施衣過後畜十七戒.txt", "四藥受淨篇/過前受急施衣過後畜十七戒二版b.txt", "隨機羯磨導讀.txt", "隨機羯磨/總目錄.txt", "隨機羯磨/自序.txt", "隨機羯磨/科.txt", "隨機羯磨/隨機羯磨天因法師講義.txt", "隨機羯磨/920518.txt", "隨機羯磨/隨機羯磨淺釋講記電子檔.txt", "隨機羯磨/附錄等.txt", "隨機羯磨/更正表.txt", "止持會集/毗尼止持會集.txt", "僧伽作持要集/僧伽作持要集目錄.txt", "僧伽作持要集/930516.txt", "僧伽作持要集/僧伽作持要集回向偈.txt", "常用僧伽作持/目錄.txt", "常用僧伽作持/930531.txt", "結夏安居解夏自恣儀軌/910603.txt", "結夏安居解夏自恣儀軌/校正表.txt", "戒場行事表/戒場行事表.txt", "戒場行事表/戒場作息表1.txt", "戒場行事表/戒場作息表2.txt", "果良律師全集.txt", "四分律比丘尼戒本講記(上).txt", "四分律比丘尼戒本講記(下).txt", "比丘尼戒講義/p1-p28.txt", "比丘尼戒講義/p29-p32.txt", "比丘尼戒講義/p33.txt", "比丘尼戒講義/p34-p37.txt", "比丘尼戒講義/p38.txt", "比丘尼戒講義/p39-p49.txt", "比丘尼戒講義/p50-p55.txt", "比丘尼戒講義/p56-p57.txt", "比丘尼戒講義/p58.txt", "比丘尼戒講義/p59-p62.txt", "比丘尼戒講義/p63-p65.txt", "比丘尼戒講義/p66-p67.txt", "比丘尼戒講義/p68-p71.txt", "比丘尼戒講義/p72.txt", "比丘尼戒講義/p73-p79.txt", "比丘尼戒講義/p80-p86.txt", "比丘尼戒講義/p101.txt", "比丘尼戒講義/p102.txt", "比丘尼戒講義/p103.txt", "比丘尼戒講義/p104.txt", "比丘尼戒講義/p105.txt", "比丘尼戒講義/p106.txt", "比丘尼戒講義/p107.txt", "比丘尼戒講義/p108-p119.txt", "比丘尼戒講義/p120-p124.txt", "比丘尼戒講義/p125-p131.txt", "比丘尼戒講義/p135.txt", "比丘尼戒講義/p136-p138.txt", "比丘尼戒講義/p139-p141.txt", "尼戒/尼戒講義－出書版/目錄.txt", "尼戒/尼戒/二繩圍輪界結法.txt", "尼戒/尼戒/大殿山門.txt", "尼戒/尼戒/八敬法.txt", "尼戒/尼戒/尼表記講義.txt", "尼戒/尼戒/典型結無戒場大界.txt", "尼戒/尼戒/袈裟製作圖.txt", "尼戒/尼戒/過前受急施衣過後畜十七戒 正.txt", "尼戒/尼戒/諸食藥體1.txt", "尼戒/尼戒/獨渡河戒犯相表.txt", "尼戒/尼註/尼 註.txt", "尼眾別行篇/前言.txt", "尼眾別行篇/尼眾別行.txt", "尼眾別行篇/警意之緣.txt", "尼眾別行篇/尼別篇標科.txt", "尼眾別行篇/獨入村戒.txt", "尼眾別行篇/獨在後行戒--補充.txt", "尼眾別行篇/獨在後行戒.txt", "尼眾別行篇/獨宿戒--二版.txt", "尼眾別行篇/獨宿戒.txt", "尼眾別行篇/獨渡水戒.txt", "尼眾別行篇/菩薩不觸女人.txt", "尼眾別行篇/四獨學處/尼眾別行篇--附表--更正版.txt", "尼眾別行篇/四獨學處/尼眾別行篇--附表--更正版a.txt", "尼眾別行篇/四獨學處/尼眾別行篇--附表更正版.txt", "尼眾別行篇/四獨學處-三版/四 獨學處--1--950207.txt", "尼眾別行篇/四獨學處-三版/四 獨 學處--3--950207.txt", "尼眾別行篇/四獨學處-三版/四 獨 學處--2--950207.txt", "尼眾別行篇/四獨學處-三版/四 獨  學 處--4--950207.txt", "尼眾別行篇/四獨學處-三版/四獨學處--附圖p17.txt", "尼眾別行篇/四獨學處-三版/四獨學處附圖p24.txt", "尼眾別行篇/四獨學處-三版/四獨學處附圖p25.txt", "尼眾別行篇/尼別篇New/警意之緣.txt", "尼眾別行篇/尼別篇New/940923--尼眾別行篇.txt", "尼眾別行篇/尼別篇New/940919--尼眾別行篇--附表.txt", "尼眾別行篇/尼別篇New/四 獨 初 探--1.txt", "尼眾別行篇/尼別篇New/四 獨 初 探--2.txt", "尼眾別行篇/尼別篇New/四 獨 初 探--3.txt", "尼眾別行篇/尼別篇New/四 獨 初 探--完全.txt", "尼眾別行篇/尼別篇New/尼別篇--附表p13,14.txt", "尼眾別行篇/尼別篇New/尼別篇--附表p17,18.txt", "尼眾別行篇/尼別篇New/尼別篇--附表p19.txt", "尼鈔/尼 鈔.txt", "尼鈔/尼鈔講義上版.txt", "尼鈔/尼鈔講義下版.txt", "尼鈔/止作二持二犯p1.txt", "尼鈔/大界p2.txt", "尼鈔/大界p3.txt", "尼鈔/打犍搥p4.txt", "尼鈔講記/序文等.txt", "尼鈔講記/四分律比丘尼鈔講記科文.txt", "尼鈔講記/四分律比丘尼鈔講記-941026.txt", "律學指南/律學指南.txt", "律學指南/律學指南附錄.txt", "律學指南/般若概述.txt", "律學釋疑/篇首－910603.txt", "律學釋疑/凡例910603.txt", "律學釋疑/目錄910531.txt", "律學釋疑/序文一910109.txt", "律學釋疑/序文二910109.txt", "律學釋疑/重修序一910528.txt", "律學釋疑/910610.txt", "律學釋疑/索引910610.txt", "律學釋疑/索引一－910604.txt", "律學釋疑/索引二－910604.txt", "毗尼答問1.txt", "律學辭典/律學辭典.txt", "在家菩薩戒本/傳授五戒菩薩戒儀範--目錄.txt", "在家菩薩戒本/在家菩薩戒本.txt", "在家菩薩戒本/傳授五戒菩薩戒儀範.txt", "在家菩薩戒本/傳授五戒菩薩戒儀範(一).txt", "在家菩薩戒本補充講表.txt", "在家菩薩戒本/天因法師/在家菩薩戒本補充講表910421.txt", "在家菩薩戒本/本因法師/在家菩薩戒01.txt", "在家菩薩戒本/本因法師/在家菩薩戒淺釋２.txt", "在家菩薩戒本/本因法師/在家菩薩戒淺釋３.txt", "梵網菩薩戒/梵網經菩薩戒.txt", "梵網菩薩戒/菩薩四十八輕.txt", "梵網經菩薩戒彙解.txt", "梵網經菩薩心地品卷上彙釋081112.txt", "盜戒資料/瑜伽講習/說明.txt", "盜戒資料/瑜伽講習/02障布施度doc.txt", "盜戒資料/瑜伽講習/《瑜伽師地論》三聚淨戒--攝決擇分.txt", "盜戒資料/瑜伽講習/《瑜伽師地論》四攝法.txt", "盜戒資料/瑜伽講習/瑜伽菩薩懺悔法.txt", "瑜伽菩薩戒/第12倒說菩薩戒：.txt", "瑜伽菩薩戒/第26背大向小戒.txt", "瑜伽菩薩戒/瑜伽菩薩戒-唐版.txt", "瑜伽菩薩戒/瑜伽菩薩戒本.txt", "瑜伽菩薩戒/瑜伽菩薩戒本講義.txt", "瑜伽菩薩戒/瑜伽菩薩戒講義.txt", "瑜伽菩薩戒/瑜伽菩薩戒本講義(更新版).txt", "妙因律師律學集.txt", "濟濤律師遺集/濟濤遺集.txt", "廣化律師全集/總目次.txt", "廣化律師全集/廣化律師全集第1集-律學編/五戒相經箋要集註.txt", "廣化律師全集/廣化律師全集第1集-律學編/戒學淺談第一講.txt", "廣化律師全集/廣化律師全集第1集-律學編/沙彌律儀要略.txt", "廣化律師全集/廣化律師全集第1集-律學編/梵網經菩薩戒.txt", "五戒相經.txt", "戒學淺談.txt", "沙 彌 律 儀.txt", "廣化律師全集/廣化律師全集第2集-四分律比丘戒本講義/四分律比丘戒本講義.txt", "廣化律師全集/廣化律師全集第3集-佛學編/佛學編.txt", "廣化律師全集/廣化律師略傳/廣化律師略傳.txt", "我的通用字1.txt", "我的通用字2.txt", "Sila-txt0401.txt"]
// ===============================================
// 開始讀檔
// for (var k = 0; k < lst.length; k++) {
for (var k of lst) {
    // 用絕對路徑讀入檔案，使用陣列中的檔名
    // var n = path.normalize(h + '/' + k)
    var a = fs.readFileSync(k, ru)
    // 導入陣列，準備編輯
    // 刪除過多的空行，及<頁<段
    // 因為《續藏》第1行是頁碼，必須刪除第1行的頁碼，但先要在最前面加一行，不然在後面的for b[0]會轉換不到
    // a = '<file>\n' + a + '\n</file>'
    // 三大部之前已經轉換好了，所以跳過，不必重復轉換
    if (k == '三  大  部/s.txt' || k == '三  大  部/x.txt' || k == '三  大  部/j.txt') {
        // 導入物件內
        okfile += a
        // 各檔完成時返回通知
        console.log('arrpb is OK: ' + k)
    } else {
        var b = a
            // .replace(/<頁碼? [^>]+>[\n|\r]*/g, '')
            // .replace(/<段\/?>[\n|\r]*/g, '')
            // .replace(/[\n|\r]{3,}/g, '\n\n')
            // 接合標記內的斷行
            .replace(/(<[^>]*)[\n|\r]([^>]*>)/g, '$1$2\n')
            .replace(/<頁碼? [^>]+>/g, '')
            .replace(/<段\/?>/g, '')
            .replace(/<\/?史>/g, '')
            .replace(/<聯 i/g, '<k to')
            .replace(/<聯 l/g, '<a href')
            .replace(/聯>/g, 'a>')
            .replace(/<_-書 .+/g, '<article')
            .replace(/_-章>/g, 'le>')
            .replace(/_-節>/g, 'je>')
            .replace(/<檔[^>]*>/g, '======')
            .replace(/<\/檔>/g, '====')
            .replace(/&/g, '＆')
            // 太多了，不好編輯，所以刪除
            .replace(/<\/?粗>/g, '')
            .replace(/經>/g, 'xa>')
            // .replace(/字母>/g, 'h1>')
            .replace(/編目資訊>/g, 'ml>')
            .replace(/編輯>/g, 'kai>')
            .replace(/原書分頁>/g, 'hr>')
            .replace(/相應部>/g, 'sep>')
            .replace(/英文名>/g, 'eng>')
            .replace(/<嵌?圖 f/g, '<img n')
            .replace(/<註/g, '<fn')
            .replace(/註>/g, 'fn>')
            // .replace(/<釋([^>]+)\/>(.*)/g, '<h1$1>$2</h1>')
            .replace(/<釋/g, '<a')
            .replace(/釋>/g, 'a>')
            .replace(/<頁碼>/g, '<rubynote t="')
            .replace(/<\/頁碼>/g, '"/>')
            .replace(/<偏右字>/g, '<rubynote t="')
            .replace(/<\/偏右字>/g, '"/>')
            .replace(/序>/g, 'talk>')
            .replace(/分>/g, 'pv>')
            .replace(/跋>/g, 'ba>')
            .replace(/會>/g, 'va>')
            .replace(/其他>/g, 'other>')
            .replace(/附文>/g, 'ps>')
            .replace(/科判>/g, 'h0>')
            .replace(/卷>/g, 'sarticle>')
            .replace(/<冊/g, '<book')
            .replace(/冊>/g, 'book>')
            .replace(/<集/g, '<group')
            .replace(/集>/g, 'group>')
            .replace(/<編/g, '<group')
            .replace(/編>/g, 'group>')
            .replace(/大>/g, 'tag>')
            .replace(/表>/g, 'kai>')
            .replace(/<書/g, '<article')
            .replace(/書>/g, 'article>')
            .replace(/章>/g, 'h1>')
            .replace(/節>/g, 'h2>')
            .replace(/類>/g, 'h3>')
            .replace(/項>/g, 'h4>')
            .replace(/文>/g, 'h5>')
            .replace(/篇>/g, 'h6>')
            .replace(/年>/g, 'year>')
            .replace(/詩>/g, 'si>')
            .replace(/著者>/g, 'sr>')
            .replace(/詞>/g, 'tag>')
            .replace(/人名>/g, 'name>')
            .replace(/問>/g, 'ask>')
            .replace(/答>/g, 'rep>')
            .replace(/小字>/g, 'little>')
            .replace(/字>/g, 'zi>')
            .replace(/原出處>/g, 'ptr>')
            .replace(/參考書>/g, 'def>')
            .replace(/期>/g, 'l>')
            .replace(/藥>/g, 'by>')
            .replace(/方>/g, 'bf>')
            .replace(/症>/g, 'bz>')
            .replace(/甲>/g, 'h1>')
            .replace(/乙>/g, 'h2>')
            .replace(/丙>/g, 'h3>')
            .replace(/丁>/g, 'h4>')
            .replace(/戊>/g, 'h5>')
            .replace(/己>/g, 'h6>')
            .replace(/庚>/g, 'h7>')
            .replace(/辛>/g, 'h8>')
            .replace(/壬>/g, 'h9>')
            .replace(/癸>/g, 'h10>')
            .replace(/子>/g, 'h11>')
            .replace(/丑>/g, 'h12>')
            .replace(/寅>/g, 'h13>')
            .replace(/卯>/g, 'h14>')
            .replace(/辰>/g, 'h15>')
            .replace(/巳>/g, 'h16>')
            .replace(/午>/g, 'h17>')
            .replace(/未>/g, 'h18>')
            .replace(/申>/g, 'h19>')
            .replace(/酉>/g, 'h20>')
            .replace(/戌>/g, 'h21>')
            .replace(/亥>/g, 'h22>')
            .replace(/日>/g, 'h23>')
            .replace(/月>/g, 'h24>')
            .replace(/火>/g, 'h25>')
            .replace(/水>/g, 'h26>')
            .replace(/木>/g, 'h27>')
            .replace(/金>/g, 'h28>')
            .replace(/土>/g, 'h29>')
            .replace(/春>/g, 'h30>')
            .replace(/夏>/g, 'h31>')
            .replace(/秋>/g, 'h32>')
            .replace(/冬>/g, 'h33>')
            .replace(/東>/g, 'h34>')
            // .replace(/《/g, '<bf>《')
            // .replace(/》/g, '》</bf>')
            // .replace(/〈/g, '<by>〈')
            // .replace(/〉/g, '〉</by>')
            // .replace(/〔/g, '<bz>〔')
            // .replace(/〕/g, '〕</bz>')
            .replace(/(<\/by>)<\/by>/g, '$1')
            .replace(/(<\/bf>)<\/bf>/g, '$1')
            .replace(/(<\/bz>)<\/bz>/g, '$1')
            .replace(/(<by>)<by>/g, '$1')
            .replace(/(<bf>)<bf>/g, '$1')
            .replace(/(<bz>)<bz>/g, '$1')
            .split('\n')

        // 100字切行
        for (var i = 0; i < b.length; i++) {
            b[i] = b[i].replace(/(.{100})/g, '$1\n')
                // 接合標記內的斷行
                .replace(/(<[^>]*)[\n|\r]([^>]*>)/g, '$1$2\n')
        }

        // 導入陣列內
        okfile += b.join('\n')
        // 各檔完成時返回通知
        console.log('arrpb is OK: ' + k)
    }
}

// ===============================================
// 因為整合寫入一個檔內，所以等全部寫入後再上頁碼
var z = okfile.split('\n')
// 加上批次冊碼頁碼
// 預設變量，才能累加冊碼頁碼
var s0 = 0
var s1 = 0
var s2 = 1
var sfn = 1
var sa = 1

// 第1行不好轉換，會出現亂碼，所以從第2行開始
for (var i = 1; i < z.length; i++) {
    // 刪除行首空白
    // z[i] = z[i].replace(/^ +/g, '')
    // 加上冊碼頁碼
    // 多個檔案的時候，不好算出冊碼，就省去冊碼
    if (/<article/.test(z[i]) || i == 1 || s2 > 1023) {
        s2 = 1
        // s1++
        // z[i] = '<pb n="' + s1 + '.' + s2 + '"/>\n' + z[i]
        z[i] = '<pb n="' + s2 + '"/>\n' + z[i]
        s0 = i + 30
    }
    if (i == s0) {
        s2++
        // z[i] = '<pb n="' + s1 + '.' + s2 + '"/>\n' + z[i]
        z[i] = '<pb n="' + s2 + '"/>\n' + z[i]
        s0 = i + 30
    }
}
// 用絕對路徑寫入檔案
fs.writeFileSync('D:/GitHub/sila_more-corpus/ok.xml', '<file>\n' + z.join('\n') + '\n</file>', wu)

// 全部完成時返回通知
console.log('All is OK')

// 'test'名字要和time()中的名字保持一致
console.timeEnd('共耗費了')